{"subreddit": "ucr", "body": "Submit your classes [here](https://docs.google.com/forms/d/1ieV9hByRgtBzp4mrEwRcNBNFnLC9f4XfZ6RPoa-NrD4)\n\n______\nDatabase:\n\nhttps://docs.google.com/spreadsheets/d/1qiy_Oi8aFiPmL4QSTR3zHe74kmvc6e_159L1mAUUlU0\n\n\n____________\n\nLast updated **March 7th**, 2023\n________\n\n[Github](https://github.com/ryuzu001/updatedatabase)\n\n^(If you find a problem with the database, please PM me. Thanks.)", "title": "[MEGATHREAD] UCR course database", "id": "638mh5", "score": 205, "url": "https://www.reddit.com/r/ucr/comments/638mh5/megathread_ucr_course_database/", "permalink": "/r/ucr/comments/638mh5/megathread_ucr_course_database/"}
{"subreddit": "ucr", "body": "Can everyone collectively do us all a favor and park correctly cause this persons shitty parking took up two parking spaces smh. This isn’t even the first time I’ve seen bad parking it happens way too often so I have to call them out this time.", "title": "Parking shaming (lot 30)", "id": "135ve6w", "score": 31, "url": "https://i.redd.it/tctu04321ixa1.jpg", "permalink": "/r/ucr/comments/135ve6w/parking_shaming_lot_30/"}
{"subreddit": "ucr", "body": "", "title": "Kudos to the people who remove those stickers, fuck that guy", "id": "13618ca", "score": 8, "url": "https://i.redd.it/mj1qqaoxmhxa1.jpg", "permalink": "/r/ucr/comments/13618ca/kudos_to_the_people_who_remove_those_stickers/"}
{"subreddit": "ucr", "body": "failed midterm\n\ni think its time for  me. \n\n&#x200B;\n\n*Processing gif js7tbzt3tixa1...*", "title": "nothing important", "id": "135zipq", "score": 8, "url": "https://www.reddit.com/r/ucr/comments/135zipq/nothing_important/", "permalink": "/r/ucr/comments/135zipq/nothing_important/"}
{"subreddit": "ucr", "body": "Hey guys I'm a senior in hs right now and applied to irvine, sd, sb, and la but got rejected by all of them. I understand that if you're top 9% of ca students or smt then you're guranteed a spot at one of the UCs that have room so I got an email from merced with a spot there in early april along with my friends. But last thursday I was also offered a spot at UCR which I took but none of my other friends got an email from riverside so I was curious about why I got it even though it seems like they had better stats than me?", "title": "Didn't apply to UCR but got in?", "id": "13632an", "score": 5, "url": "https://www.reddit.com/r/ucr/comments/13632an/didnt_apply_to_ucr_but_got_in/", "permalink": "/r/ucr/comments/13632an/didnt_apply_to_ucr_but_got_in/"}
{"subreddit": "ucr", "body": "Hi everyone, so I'm reporting on what has been discussed by UCR Admin and UCPD for their plans for campus safety going forward. I wasn't at the meeting but I know a couple of folks who did attend so I made a report since policing is a big issue for the community. This is also the first open public meeting they've had.\n\nRegarding mental health, UCPD has stated they are in the midsts of hiring mobile mental health professionals to respond to crisis. They say once these professionals are hired, they will respond to calls instead of UCPD officers. This is referring to their SWIFT mental health advocates.\n\nAs an aside- One of the community concerns for this effort is that recently, the UC campuses mental health practitioners have reported that most UCs are unable to recruit qualified staff to work on these mobile crisis teams. Schools which have successfully implemented this are UCSC and UCSD,respectively. Without these mobile units operational, police intervention is the only response available for students in crisis. It should be noted that UCR's plans for a mobile mental health team have been ongoing for at least two years now. No clarification was given regarding what caused the multiple year delay for the program's launch.\n\nSecondly, an undergraduate student mentioned there was a police call placed on a group of striking union members during their efforts to liberate the Glascow dining hall. What this is in reference to is that during the Winter 2022 TA strike, a smaller group of union members demonstrated protest by physically blocking the exit and entry doors of dining halls across the UC system to allow students to walk in and out of the dining hall without needing to pay, hence the term \"liberation\". It was mentioned that UCR was the only UC campus to have the police called on them while performing this demonstration. Community members urged that this incident was documented through social media, so it did in fact, was witnessed by part of the campus community. UCR Admin initially stated to no clue what the student was referring to. However, once more folks mentioned the incident, they backpedaled and stated they knew of the call but emphasized they did not send police.  \n\nFact check wise, I personally remember witnessing the police block the streets leading to Glascow and intervening. Other community members reportedly also stated this as well during the meeting. So it's not clear why UCR admin and UCPD would say otherwise at the police accountability meeting...\n\nAnyway this is where the conversation about campus safety stands.", "title": "5/1/23 UCPD Accountability Public Meeting NOTES", "id": "1360vlo", "score": 3, "url": "https://www.reddit.com/r/ucr/comments/1360vlo/5123_ucpd_accountability_public_meeting_notes/", "permalink": "/r/ucr/comments/1360vlo/5123_ucpd_accountability_public_meeting_notes/"}
{"subreddit": "ucr", "body": "Does faculty mentored research mean that the student chooses a topic that they want to research and studies it with a professor mentoring them, or does it mean that the student takes part in the professor’s research? \nThis was so confusing to me when I was going over the programs that UCR has.", "title": "Undergrad research at UCR", "id": "135n0yt", "score": 8, "url": "https://www.reddit.com/r/ucr/comments/135n0yt/undergrad_research_at_ucr/", "permalink": "/r/ucr/comments/135n0yt/undergrad_research_at_ucr/"}
{"subreddit": "ucr", "body": "Hey guys looking to buy graduation tickets for June 20th 1pm. Only paying in person on the day of or after distribution. Lmk", "title": "Graduation tickets", "id": "13645h3", "score": 1, "url": "https://www.reddit.com/r/ucr/comments/13645h3/graduation_tickets/", "permalink": "/r/ucr/comments/13645h3/graduation_tickets/"}
{"subreddit": "ucr", "body": "Is their class today, the usual room is empty ?", "title": "Dance005 with Antonio", "id": "1363mxi", "score": 1, "url": "https://www.reddit.com/r/ucr/comments/1363mxi/dance005_with_antonio/", "permalink": "/r/ucr/comments/1363mxi/dance005_with_antonio/"}
{"subreddit": "ucr", "body": "I’m currently an English major but have suddenly become really interested in psychology but I want to know how the psychology major required classes are. The one that worries me more is math and chemistry. Do you guys take high levels of chemistry or biology and also what’s the highest you need for math? Also any tips or personal experience is highly appreciated thank you !", "title": "Psychology Majors how are your classes", "id": "135vk1h", "score": 2, "url": "https://www.reddit.com/r/ucr/comments/135vk1h/psychology_majors_how_are_your_classes/", "permalink": "/r/ucr/comments/135vk1h/psychology_majors_how_are_your_classes/"}
